
%1번 과제

%왼쪽 아래를 A점, 중간 위를 B, 오른쪽 아래를 C라 한다.
%힘의 평형과 모멘트 평형 계산에 의해
%Ax=0, Ay=-750, Bx=0, By=1500, Cx=0, Cy=-750 단위는 모두 N 이다.
E=210*10^9;
A=2*10^(-4);

%Element1(A.B) 구하기
x=cos(30);
y=sin(30);
K1=E*A/0.5*[x^2, x*y, -x^2, -x*y; x*y, y^2, -x*y, -y^2; -[x^2, x*y, -x^2, -x*y]; -[x*y, y^2, -x*y, -y^2]];

%Element2(B.C) 구하기
x= cos(150);
y=sin(150);
K2=E*A/0.50*[x^2, x*y, -x^2, -x*y; x*y, y^2, -x*y, -y^2; -[x^2, x*y, -x^2, -x*y]; -[x*y, y^2, -x*y, -y^2]];

%Element3(A,C) 구하기
x=cos(0);y=sin(0);
K3=E*A/(0.50*sqrt(3))*[x^2, x*y, -x^2, -x*y; x*y, y^2, -x*y, -y^2; -[x^2, x*y, -x^2, -x*y]; -[x*y, y^2, -x*y, -y^2]];


X=zeros(6);
X(1:4,1:4)=K1;
Y(3:6,3:6)=K2;
Z(1:2,1:2)=K3(1:2,1:2);
Z(5:6,1:2)=K3(3:4,1:2);
Z(5:6,5:6)=K3(3:4,3:4);
Z(1:2,5:6)=K3(1:2,3:4);

% K Total을 구한다
K=X+Y+Z;

% u1x,u1y =0,u3y=0 F2x=0, F2y=1500N 을 이용하면
% [-750;0;1500;-750]=K(2:5,3:5)*[u2x;u2y;u3x] 이므로
Answer=pinv(K(2:5,3:5))*[-750;0;1500;-750];

u2x=Answer(1);
u2y=Answer(2);
u3x=Answer(3);



%2번 과제

%좌측 상단부터 Element를 1~6이라고 정의하며
%절점도 좌측 상단부터 A~E이라고 정의한다
E=210*10^9;
A=2*10^(-4);

%Element1(A.B) 구하기
x= cos(0);
y=sin(0);
K1=E*A/0.1*[x^2, x*y, -x^2, -x*y; x*y, y^2, -x*y, -y^2; -[x^2, x*y, -x^2, -x*y]; -[x*y, y^2, -x*y, -y^2]];

%Element2(B.C) 구하기
x= cos(0);
y=sin(0);
K2=E*A/0.1*[x^2, x*y, -x^2, -x*y; x*y, y^2, -x*y, -y^2; -[x^2, x*y, -x^2, -x*y]; -[x*y, y^2, -x*y, -y^2]];

%Element3(A,E) 구하기
x=cos(135);y=sin(135);
K3=E*A/(0.1*sqrt(2))*[x^2, x*y, -x^2, -x*y; x*y, y^2, -x*y, -y^2; -[x^2, x*y, -x^2, -x*y]; -[x*y, y^2, -x*y, -y^2]];

%Element4(B,E) 구하기
x= cos(90);
y=sin(90);
K4=E*A/0.1*[x^2, x*y, -x^2, -x*y; x*y, y^2, -x*y, -y^2; -[x^2, x*y, -x^2, -x*y]; -[x*y, y^2, -x*y, -y^2]];

%Element5(C,E) 구하기
x=cos(45);
y=sin(45);
K5=E*A/(0.1*sqrt(2))*[x^2, x*y, -x^2, -x*y; x*y, y^2, -x*y, -y^2; -[x^2, x*y, -x^2, -x*y]; -[x*y, y^2, -x*y, -y^2]];

%Element6(D,E) 구하기
x=cos(0);y=sin(0);
K6=E*A/0.1*[x^2, x*y, -x^2, -x*y; x*y, y^2, -x*y, -y^2; -[x^2, x*y, -x^2, -x*y]; -[x*y, y^2, -x*y, -y^2]];

X=zeros(10);
X(1:4,1:4)=K1;

Y=zeros(10);
Y(3:6,3:6)=K2;

Z(1:2,1:2)=K3(1:2,1:2);
Z(1:2,9:10)=K3(1:2,3:4);
Z(9:10,1:2)=K3(3:4,1:2);
Z(9:10,9:10)=K3(3:4,3:4);

O(3:4,3:4)=K4(1:2,1:2);
O(3:4,9:10)=K4(1:2,3:4);
O(9:10,3:4)=K4(3:4,1:2);
O(9:10,9:10)=K4(3:4,3:4);

P(5:6,5:6)=K5(1:2,1:2);
P(5:6,9:10)=K5(1:2,3:4);
P(9:10,5:6)=K5(3:4,1:2);
P(9:10,9:10)=K5(3:4,3:4);

Q(7:10,7:10)=K6;


% K Total을 구한다
K=X+Y+Z+O+P+Q;

% u1x,u1y =0, u4x,u4y =0,F2x=0, F2y=-700N, F3x=0,, F3y=-700 을 이용하면

% [0;-700;0;-700;0;0]=K의 일부*[u2x;u2y;u3x;u3y;u5x;u5y] 이므로
K(1:2,:)=[];
K(7:8,:)=[];
K(:,1:2)=[];
K(:,7:8)=[];

Answer=pinv(K)*[0;-700;0;-700;0;0];

u2x=Answer(1);
u2y=Answer(2);
u3x=Answer(3);
u3y=Answer(4);
u5x=Answer(5);
u5y=Answer(6);



